Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་སློང་བལྟ་ན་སྡུག་པ་གང་ན་བ་དེར་ཕྱིན་ནས། དགེ་སློང་བལྟ་ན་སྡུག་པའི་རྐང་པའི་བོལ་གཉིས་ལ་སྤྱི་བོས་གཏུགས་ཏེ་ཕྱག་འཚལ་ནས།
en: Sudhana, the head merchant’s son, approached the bhikṣu Sudarśana and bowed his head onto the surface of the bhikṣu Sudarśana’s feet, covered the surface of the bhikṣu Sudarśana’s feet with kisses, and wiped them well.

source: དགེ་སློང་བལྟ་ན་སྡུག་པའི་རྐང་པའི་བོལ་གཉིས་ལ་བཞིན་སྦྱར་ཏེ། ལེགས་པར་ཕྱིན་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་བ་ཞིག་ལགས་ཏེ།
en: Then Sudhana sat down before the bhikṣu Sudarśana and with his hands placed together said, “Ārya, I am set on the highest, complete enlightenment and am seeking bodhisattva conduct.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ། དེས་སྨྲས་པ།
en: Explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: རིགས་ཀྱི་བུ། ཁོ་བོ་ནི་ཚེས་བཏབ་ན་དར་ལ་བབ་པ། རབ་ཏུ་བྱུང་བས་བཏབ་ན་གསར་དུ་ཞུགས་པ་སྟེ།
en: The bhikṣu Sudarśana said, “Noble one, having reached adulthood, I am newly entered into the homeless life.

source: རིགས་ཀྱི་བུ། ཁོ་བོས་ནི་ཚེ་དེ་འདྲ་བ་གཅིག་གིས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གངྒཱ་སུམ་ཅུ་རྩ་བརྒྱད་ཀྱི་དྲུང་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ།
en: “Noble one, I have in this one lifetime practiced celibacy before as many tathāgatas as there are grains of sand in thirty-eight Ganges Rivers.

source: བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞམ་རིང་དུ་ནི་ཉིན་ཞག་གཅིག་དུ་ཚངས་པའི་སྤྱོད་པ་སྤྱད་དོ། །
en: I practiced celibacy with some for a day and night.

source: ལ་ལར་ནི་ཉིན་ཞག་བདུན་དུ།
en: I practiced celibacy with some for seven days.

source: ལ་ལར་ནི་ཟླ་བ་ཕྱེད་དུ།
en: I practiced celibacy with some for half a month.

source: ལ་ལར་ནི་ཟླ་བ་གཅིག་ཏུ།
en: I practiced celibacy with some for a month.

source: ལ་ལར་ནི་ལོ་གཅིག་ཏུ།
en: I practiced celibacy with some for a year.

source: ལ་ལར་ནི་ལོ་བརྒྱར།
en: I practiced celibacy with some for a hundred years.

source: ལ་ལར་ནི་ལོ་སྟོང་དུ།
en: I practiced celibacy with some for a thousand years.

source: ལ་ལར་ནི་ལོ་བརྒྱ་ཕྲག་སྟོང་དུ།
en: I practiced celibacy with some for a hundred thousand years.

source: ལ་ལར་ནི་ལོ་བྱེ་བར།
en: I practiced celibacy with some for ten million years.

source: ལ་ལར་ནི་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་དུ།
en: I practiced celibacy with some for a quintillion years.

source: ལ་ལར་ནི་ལོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པར། ལ་ལར་ནི་བསྐལ་པ་བར་མར།
en: I practiced celibacy with some for an anabhilāpyānabhilāpya­parivarta of years.

source: ལ་ལར་ནི་བསྐལ་པ་ཕྱེད་དུ། ལ་ལར་ནི་བསྐལ་པར། བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞམ་རིང་དུ་ནི།
en: I practiced celibacy with some for an intermediate kalpa.

source: བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པར་ཚངས་པའི་སྤྱོད་པ་སྤྱད་དེ།
en: I practiced celibacy with some for half a kalpa.

source: བསྐལ་པ་བགྲང་བའི་ཚུལ་འདི་ཉིད་ཀྱིས།
en: I practiced celibacy with some for a kalpa.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལས་ཆོས་བསྟན་པ་ཐོས་ཏེ། གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་ཡང་དག་པར་བླངས་སོ། །
en: I heard the Dharma from all those tathāgatas and received their instructions and teachings.

source: སྨོན་ལམ་གྱི་རྒྱུན་ཡོངས་སུ་སྦྱངས་སོ། །
en: “I have purified an array of prayers.

source: ཡང་དག་པར་བསྒྲུབ་པའི་ཡུལ་ལ་ཞུགས་སོ། །སྤྱོད་པའི་དཀྱིལ་འཁོར་ཡོངས་སུ་སྦྱངས་སོ། །
en: I have purified the field of conduct that enters the range of realization.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རྒྱ་མཚོ་ཡོངས་སུ་རྫོགས་པར་བྱས་སོ། །
en: “I have completed an ocean of the perfections.

source: མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ། ཡོངས་སུ་ཤེས་པར་བྱས་སོ། །
en: I have perceived the miraculous manifestations of complete buddhahood.

source: དེ་དག་གི་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་བ་ཕན་ཚུན་མ་འདྲེས་པ་དག་ཀྱང་ཡོངས་སུ་བཟུང་ངོ་། །
en: I have held their wheels of Dharma each distinct from another.

source: དེ་དག་གི་སྟོབས་མཉམ་པ་ཉིད་ཀྱང་། ཁོང་དུ་ཆུད་པར་བྱས་སོ། །
en: “I have realized the equality of their strengths.

source: དེ་དག་གིས་བསྟན་པ་ཡང་དམ་པའི་ཆོས་ཟད་པའི་མཐར་ཐུག་གི་བར་དུ་ཡོངས་སུ་བཟུང་ངོ་། །
en: I have held their teachings for as long as their Dharma remained.

source: ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་རྣམས་ཀྱང་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་གྱི་ཏིང་ངེ་འཛིན་མངོན་པར་བསྒྲུབ་པའི་སྟོབས་ཀྱིས་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་པར་བསྒྲུབས་སོ། །
en: “I have accomplished, through the power of the accomplishment of the samādhi of the field of prayer, the previous prayers of all those tathāgatas for the purification of my own buddha realm.

source: ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམས་ཀྱང་སྤྱོད་པ་ཐམས་ཅད་ལ་འཇུག་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པའི་སྟོབས་ཀྱིས་རང་གི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་པར་བསྒྲུབས་སོ། །
en: “I have accomplished, through the power of entering the samādhi of entering all conducts, the past practice of bodhisattva conduct by all those tathāgatas for the purification of my own conduct.

source: ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་ཡང་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པས་འབྱུང་བའི་སྟོབས་ཀྱིས་མངོན་པར་བསྒྲུབས་སོ། །གཞན་ཡང་རིགས་ཀྱི་བུ།
en: “I have accomplished, through the power of setting forth on completely good conduct, the pure perfections of all those tathāgatas.

source: ཁོ་བོ་འཆག་ས་འདི་ན་འཆག་པའི་ཚེ། ཕྱོགས་ཀྱི་རྒྱུད་ཀྱི་སྒོ་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་རྣམ་པར་ལྟ་བའི་ཡེ་ཤེས་ཀྱི་སྒོས་མངོན་དུ་འགྱུར་རོ། །
en: “Moreover, noble one, because of the gateway of the perfectly observant wisdom, while I am walking on this meditation walkway there come toward me the gateways of the continuums of all directions.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཀྱི་སྒོ་ཐམས་ཅད་ཀྱང་། སྨོན་ལམ་ཆེན་པོ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་སེམས་བསྐྱེད་པ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའིའང་བརྗོད་དུ་མེད་པ་འདའ་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་རྣམ་པར་འགྲུབ་པར་འགྱུར་རོ། །
en: “Through the arising of a single aspiration, the gateways of the continuums of all world realms are moving further away in order to purify the transcendence of an anabhilāpyānabhilāpya­parivarta of world realms through the power of accomplishing great prayers.

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སེམས་ཅན་གྱི་སྤྱོད་པའི་ཚུལ་གྱི་སྒོ་བརྗོད་དུ་མེད་པའི་ཡང་། བརྗོད་དུ་མེད་པ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་སྟོབས་བཅུའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་མངོན་སུམ་དུ་འགྱུར་རོ། །
en: “In one instant of mind, through the power of accomplishing the bodhisattva’s completely good conduct and prayers, I directly perceive an anabhilāpyānabhilāpya­parivarta of gateways of the ways of conduct among beings in order to complete the wisdoms of the ten strengths.

source: སེམས་བསྐྱེད་པ་གཅིག་ལ་སངས་རྒྱས་བརྗོད་དུ་མྱེད་པའི་ཡང་། བརྗོད་དུ་མེད་པ་མཐོང་བ་རྣམ་པར་དག་པ་དག་ཀྱང་སྔ་ཕྱིའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་པའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས། དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་། བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་མཆོད་པ་དང་། བསྙེན་བཀུར་བ་དང་།
en: “Through the arising of a single aspiration, through the power of accomplishing the prayers to make offerings to past and future buddhas, I directly perceive the vision of an anabhilāpyānabhilāpya­parivarta of buddha realms in order to make offerings to, serve, and honor tathāgatas as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of buddha realms.

source: རིམ་གྲོ་བྱ་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ། །སེམས་བསྐྱེད་པ་གཅིག་ལ་དེ་བཞིན་གཤེགས་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་རྣམས་ཀྱང་ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་འཛིན་པའི་གཟུངས་དང་། སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས།
en: “Through the arising of a single aspiration, there falls rain from the clouds of Dharma of an anabhilāpyānabhilāpya­parivarta of tathāgatas through the power of accomplishing the prayers for the mental retention of holding the Dharma wheels that follow countless ways of the Dharma.

source: ཆོས་ཀྱི་ཚུལ་གྲངས་མེད་པ་རྣམ་པར་འཚང་རྒྱ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་བསམ་པ་ལ་མངོན་པར་འབབ་བོ། །སེམས་བསྐྱེད་པ་གཅིག་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མྱིག་འཕྲུལ་ལྟ་བུར་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ། །
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayers to fulfill the bodhisattva conduct that are like magical illusions, I directly perceive the ocean of the conduct of an anabhilāpyānabhilāpya­parivarta of bodhisattvas in order to purify all fields of conduct.

source: སེམས་བསྐྱེད་པ་གཅིག་ལ་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་ཏིང་ངེ་འཛིན་གྱི་སྒོ་གཅིག་ཏུ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ཡང་དག་པར་འདུ་བར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ། །
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayer to concentrate all the fields of samādhi through a single samādhi, I directly perceive the ocean of an anabhilāpyānabhilāpya­parivarta of samādhis in order to purify all fields of samādhi.

source: སེམས་བསྐྱེད་པ་གཅིག་ལ་དབང་པོ་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་དྲན་པའི་མཐར་ཕྱིན་པའི་དབང་པོ་ཐོབ་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་དབང་པོའི་འཁོར་ལོ་དང་། དུས་ཀྱི་འཁོར་ལོ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ། །
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayer to attain the power of the highest mindfulness, I directly perceive the ocean of an anabhilāpyānabhilāpya­parivarta of powers in order to manifest all the wheels of the powers and the wheels of time.

source: སེམས་བསྐྱེད་པ་གཅིག་ལ་དུས་ཀྱི་འཁོར་ལོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ཀྱང་སེམས་ཅན་ཟད་མི་ཤེས་པ་ཟད་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་དུས་ཐམས་ཅད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བའི་ཕྱིར་མངོན་དུ་འགྱུར་རོ། །
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayer for the end of endless beings, I directly perceive an anabhilāpyānabhilāpya­parivarta of wheels of time in order to turn the wheels of Dharma in all times.

source: སེམས་བསྐྱེད་པ་གཅིག་ལ་དུས་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་ཐམས་ཅད་ཀྱང་དུས་གཅིག་ཏུ་རྣམ་པར་དགོད་པའི་ཚུལ་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་སྣང་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་དུས་གསུམ་རྣམ་པར་དགོད་པའི་ཕྱིར་མངོན་སུམ་དུ་འགྱུར་ཏེ།
en: “Through the arising of a single aspiration, through the power of the accomplishment of the prayer for the light of the wisdom of realization, I directly perceive an anabhilāpyānabhilāpya­parivarta of oceans of all three times in order to establish the three times in all world realms in a single time.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཤིན་ཏུ་ཞི་བར་མི་འགྱུར་བའི་སྒྲོན་མ་ཞེས་བྱ་བ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་བསམ་པ་རྡོ་རྗེ་ལྟ་བུ་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་སུ་རིགས་དང་ལྡན་པར་བྱུང་བ་དང་། སྲོག་གི་དབང་པོ་ལ་རྒྱུན་ཆད་པ་མེད་པ། ཡེ་ཤེས་ཀྱི་སྒྲོན་མ་ཞི་བར་འགྱུར་བ་མེད་པ། མི་ཤིགས་མི་ཕྱེད་པའི་ལུས་དང་ལྡན་པ། སྒྱུ་མའི་རྣམ་པ་ལྟ་བུའི་གཟུགས་ཤིན་ཏུ་གྲུབ་པ། རྒྱུའི་ཆོས་དང་མཉམ་པའི་ཡན་ལག་དང་། ཉིང་ལག་ཏུ་ལྡན་པའི་ལུས་ཅན་འགྲོ་བ་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམྱིགས་པར་བྱེད་པའི་ལུས་དང་ལྡན་པ། འགྲོ་བ་ཐམས་ཅད་དང་འདྲ་བའི་གཟུགས་དང་ལུས་དང་ཁ་དོག་དང་།
en: “However, noble one, I know only this bodhisattva liberation called the never-extinguished lamp of wisdom.

source: དབྱིབས་དང་ཆུ་ཞེང་ཡོངས་སུ་སྟོན་པ། མེ་མ་དག་དང་མེ་ལྕེ་དང་། དུག་དང་མཚོན་གྱིས་མི་ཚུགས་པའི་ལུས་དང་ལྡན་པ་རྡོ་རྗེས་ལྟར་སྲ་ཞིང་ཁོར་ཡུག་ལྟར་ཐུག་པ་མེད་པའི་ལུས་ཅན། བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱི་སྟོབས་མེད་པར་བྱེད་པ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་རི་བོ་དང་འདྲ་བར་འགྲོ་བ་ཀུན་ལས་མངོན་པར་འཕགས་པའི་ལུས་དང་ལྡན་པ། འགྲོ་བ་ཐམས་ཅད་དུ་རྣམ་པར་དམྱིགས་པའི་གཞི་དང་ལྡན་པ། སྒོ་ཐམས་ཅད་དུ་རྣམ་པར་དམྱིགས་ཤིང་ཐོས་པར་འགྱུར་བ།
en: How could I know or describe the qualities of the bodhisattvas whose aspiration is like a vajra; who have been born into the family that is the family of all the tathāgatas; who have the power of unceasing life; who have a lamp of wisdom that is never extinguished; who have indestructible, unbreakable bodies; who have accomplished a physical form that is like an illusion; who have bodies that have the limbs and smaller physical parts that accord with being phenomena dependent on causes; who have bodies that are perceived in accordance with the wishes of beings; who demonstrate forms, bodies, colors, shapes, and circumferences that are like those of all beings; who have bodies that are unharmed by burning embers, flames, poison, or weapons; whose bodies are as hard as vajras and as invincible as the Cakravāla mountain range; who make the power of all māras and adversaries ineffective; who resemble a mountain of Jambu River gold; who have bodies that are superior to those of all beings; who are perceived as a refuge by all beings; who are perceived and heard from all sides; who are looked up to with admiration by all beings; who are the source of the clouds of all the Dharma; who illuminate every direction; who appear beautiful as a result of destroying the mountains of obscurations; who appear as supreme heroes because they defeat all the roots of demerit; who are a joy to see because they originate from vast roots of merit; and who are as rare as fig flowers?”

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་ངོར་བལྟ་བ། ཆོས་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་འབྱུང་གནས་སུ་གྱུར་པ། ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་སྣང་བ་སྒྲིབ་པའི་རི་ཐམས་ཅད་རྣམ་པར་གཏོར་བས་བལྟ་ན་མཛེས་པ་མི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཤིན་ཏུ་འཇོམས་པས་ཤིན་ཏུ་དཔའ་བར་སྣང་བ་དགེ་བའི་རྩ་བ་རྒྱ་ཆེན་པོའི་རྒྱུ་འཐུན་པ་ལས་བྱུང་བས་བལྟ་ན་དགའ་བ་འབྱུང་བར་ཤིན་ཏུ་དཀའ་ཞིང་དཀོན་པས་མེ་ཏོག་ཨུ་དུམ་བཱ་ར་ལྟ་བུ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་དགེ་སྦྱོང་གི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་ན་གྲོང་ཁྱེར་སྒོ་བཟང་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a city called Sumukha in the land called Śramaṇa­maṇḍala.

source: དེ་ན་ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ཅེས་བྱ་བ་འདུག་གིས།
en: “There dwells a boy by the name of Indriyeśvara.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གནོན་པ་དང་། ནན་ཏན་རྣམ་པར་དག་པར་བྱ་བ་ལ་བརྩོན་པ།
en: Sudhana, the head merchant’s son, was dedicated to the pure prowess and practice of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་སྣང་བས་སེམས་ཤིན་ཏུ་སྣང་བར་གྱུར་པ།
en: His mind was illuminated by the light of the power of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་བརྟན་པ་གཞན་གྱིས་མི་ཐུབ་ཅིང་བརྒལ་ཐག་ཆད་པའི་སྙིང་དང་ལྡན་པ།
en: In his heart he had mastered the unconquerable fortitude of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་གོ་ཆ་བཟངས་པོས་སེམས་ཞུམ་པ་མེད་པ།
en: His mind was indefatigable because of the excellent armor of the resolution of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་བརྟན་པས་ཀུན་ཏུ་གནས་ཤིང་ཡོངས་སུ་འཕེལ་བར་འགྱུར་བ་ལ་བརྩོན་པ།
en: He was dedicated to the stability and vastness of the resolute aspiration of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྤྲིན་གྱི་ཆར་ཡོངས་སུ་འཛིན་པའི་བསམ་པ་དང་ལྡན་པ།
en: He had the aspiration to possess all the rain from the clouds of bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་གྱིས་ཡོངས་སུ་མི་ངོམས་པའི་རྒྱུད་དང་ལྡན་པ།
en: He had the continuity of never having enough of the rain from the clouds of Dharma of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཐམས་ཅད་ལ་འཇུག་པའི་སྨོན་ལམ་ལ་མངོན་དུ་གྱུར་པ།
en: He had the aspiration directed toward realizing all the qualities of the bodhisattvas.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཁ་ལོ་བསྒྱུར་བས་ཡོངས་སུ་སྡུད་པར་བདག་ཉིད་ཡོངས་སུ་གཏོང་བར་འདོད་པ་འགྲོ་བ་ཐམས་ཅད་འཁོར་བའི་དགོན་པ་ཆེན་པོ་ལས་བཟླ་བར་འདོད་པ།
en: He longed to send himself to be the embodiment of the charioteers for all beings.

source: དགེ་བའི་བཤེས་གཉེན་བལྟ་བ་དང་།
en: He longed to lead beings out beyond the great forest of saṃsāra.

source: མཉན་པ་དང་། བསྙེན་བཀུར་བས་ཡོངས་སུ་མི་ངོམས་པ།
en: He never had enough of gazing upon, listening to, and honoring kalyāṇamitras.

source: ཆོས་ཀྱི་རིམ་གྲོ་ཚད་མེད་པ་བསྐྱེད་པ་དང་ལྡན་པ་དེས།
en: He had developed an immeasurable veneration for the Dharma.

source: དགེ་སློང་བལྟ་ན་སྡུག་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་སློང་བལྟ་ན་སྡུག་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་སློང་བལྟ་ན་སྡུག་པའི་དྲུང་ནས་སོང་ངོ་།། །།༄༅༅། །སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་དང་པོ། །
en: Sudhana, the head merchant’s son, bowed his head to the feet of the bhikṣu Sudarśana, circumambulated the bhikṣu Sudarśana many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the presence of the bhikṣu Sudarśana.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་སློང་བལྟ་ན་སྡུག་པ་དེའི་གདམས་ངག་རྗེས་སུ་སློས་ཤིང་སྤེལ་བ་དང་། བསྡུད་པ་དང་རབ་ཏུ་དབྱེ་བ་དང་། བཤད་པ་དང་། སོ་སོར་རྣམ་པར་བསྒོམ་པ་དང་བརྗོད་པ་དང་། ཡང་དག་པར་བསྟན་པ་དང་། རྗེས་སུ་བསམ་པ་དང་། མངོན་པར་འཇུག་པར་བྱ་བ་དང་། བཀུར་བ་དང་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཡང་དག་པར་གཞོལ་བར་བྱ་བ་དང་། ཡང་དང་ཡང་བསླས་པ་དང་། ཤིན་ཏུ་རྟོགས་པར་བྱ་བ་དང་།
en: Indriyeśvara Chapter 15 Sudhana, the head merchant’s son, recited, promulgated, presented, investigated, elucidated, reflected on, described, taught, contemplated, bestowed, understood, was immersed in, repeated again and again, realized, propounded, illuminated, and surveyed the teaching of the bhikṣu Sudarśana.

source: རབ་ཏུ་བསྟན་པ་དང་། སྣང་བར་བྱ་བ་དང་། རྗེས་སུ་རྣམ་པར་ལྟ་བ་དང་། ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟའི་འཁོར་དང་བཅས་པ་དེ་མཐར་གྱིས་ཡུལ་དགེ་སྦྱོང་གི་དཀྱིལ་འཁོར་གྱི་གྲོང་ཁྱེར་སྒོ་བཟང་པོ་གང་ན་བ་དེར་ཕྱིན་ཏེ། ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས་དེའི་སྟེང་གི་བར་སྣང་ལས་ལྷ་དང་། ཀླུ་དང་།
en: He eventually, with an entourage of devas, nāgas, yakṣas, and gandharvas, arrived at the city of Sumukha in the land called Śramaṇa­maṇḍala.

source: གནོད་སྦྱིན་དང་། དྲི་ཟ་རྣམས་ཀྱིས་བོས་པ། རིགས་ཀྱི་བུ་ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ནི། ཆུ་ཀླུང་གི་ཆུ་འདུས་པ་ཉེ་བ་ཞིག་ན། བྱིས་པ་སྟོང་ཕྲག་བཅུ་ཙམ་གྱིས་བསྐོར་ཏེ།
en: He searched for the boy Indriyeśvara until the devas, nāgas, yakṣas, and gandharvas in the sky above called down, “Noble one, the boy Indriyeśvara, accompanied by ten thousand other children, is playing in the sand at the conflux of the rivers.”

source: བྱེ་མ་ལ་རྩེ་བས་རྩེ་ཞིང་འདུག་གོ་ཞེས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་སྒོ་བཟང་པོ་དང་། ཉེ་བའི་ཆུ་ཀླུང་གི་ཆུ་འདུས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་།
en: Then Sudhana, the head merchant’s son, went into the city of Sumukha toward the confluence of the rivers.

source: དེས་ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་བྱིས་པ་སྟོང་ཕྲག་བཅུ་ཙམ་གྱིས་བསྐོར་ཅིང་བྱེ་མ་ལ་རྩེ་བས་རྩེ་བ་མཐོང་ངོ་། །
en: When he arrived there, he saw the boy Indriyeśvara accompanied by ten thousand children, playing in the sand.

source: མཐོང་ནས་ཀྱང་ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གང་ན་བ་དེར་སོང་སྟེ། ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཁྱེའུ་དབང་པོའི་དབང་ཕྱུག་གི་མདུན་དུ་འདུག་སྟེ།
en: When he saw the boy Indriyeśvara, he approached him, bowed his head to the boy Indriyeśvara’s feet, circumambulated the boy Indriyeśvara many hundreds of thousands of times, keeping him to his right, and then sat down before the boy Indriyeśvara.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: He placed the palms of his hands together and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏ།
en: In what way does a bodhisattva practice it?”

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: “Ārya, I have heard that you teach and give instructions to bodhisattvas.

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཡི་གེ་དང་། གྲངས་དང་། བརྡ་དང་། །རྩིས་ཀྱི་ཚུལ་བསླབས་ཏེ། བཟོ་ཐམས་ཅད་མངོན་པར་ཤེས་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཡེ་ཤེས་ཀྱི་སྒོར་བཅུག་གོ །
en: Indriyeśvara said, “Noble one, Mañjuśrī Kumāra­bhūta has taught me writing, numbers, symbols, and counting so that I entered through the gateway called the wisdom that possesses clairvoyance in all crafts. “Thus, noble one, I know all writing and terminology in this world; all numbers, calculations, symbols, the knowledge of dice throwing, and the knowledge of the various crafts; physiology; methods to cure poisoning; exorcising śoṣas, apasmāras, bhūtas, pretas, and demons; the knowledge of where to establish villages, towns, marketplaces, cities, parks, and forest groves for ascetics; the knowledge of the measurements of walls, houses, windows, and kūṭāgāras; the knowledge of how to make various machines and chariots; the knowledge of good and bad omens, omens of danger and safety; the knowledge of the practices of farming and business; the knowledge of the analysis of the signs of the movement and characteristics of the limbs and the minor extensions of the body; the knowledge of the ways of purifying the path of karma that leads to the higher realms or the lower existences; the knowledge of good and bad groups and offerings; the knowledge of the accumulations that lead to the higher existences or to the lower existences; the knowledge of the accumulations that lead to the Śrāvakayāna and Pratyeka­buddhayāna; the knowledge of the accumulations that lead to the level of the tathāgatas; and the knowledge of the processes of application to causes and actions. “I make all beings enter into those knowledges, settle them in those knowledges, establish them in those knowledges, make them study those knowledges, make them practice those knowledges, make them stable in those knowledges, make them dedicated to those knowledges, make them complete those knowledges, make them accomplished in those knowledges, make them use those knowledges, make them elevate those knowledges, make them increase those knowledges, make those knowledges effective, bring those knowledges to their conclusion, make them purify those knowledges, make those knowledges stainless, make those knowledges shine, make those knowledges bright and clear, and make those knowledges vast.

source: དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་འཇིག་རྟེན་ན་ཡི་གེ་དང་། མྱིང་གི་རྣམ་པ་དང་། གྲངས་དང་། རྩིས་དང་།
en: “Thus, noble one, I know the way of calculations of the bodhisattvas.

source: བརྡ་དང་།
en: What is it?

source: ཤོད་ཐབས་ཤེས་པར་བྱ་བ་དང་།
en: “A hundred thousand times a hundred is ten million.

source: བཟོ་སྣ་ཚོགས་ཤེས་པར་བྱ་བ་དང་།
en: Ten million times ten million is an ayuta.

source: ཁམས་ཀྱི་ཆོ་ག་དང་། དུག་གསོ་བའི་ཐབས་དང་།
en: An ayuta times an ayuta is a niyuta.

source: སྐེམ་པ་དང་། བརྗེད་བྱེད་དང་།
en: A niyuta times a niyuta is a bimbara.

source: འབྱུང་པོའི་གདོན་གྱིས་བཏབ་པ་གསོ་བ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་།
en: A bimbara times a bimbara is a kiṃkara.

source: ཚོང་དུས་དང་། བཟའ་ཤིང་གི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་།
en: A kiṃkara times a kiṃkara is an agara.

source: གནས་རྣམ་པར་དགོད་པ་ཤེས་པར་བྱ་བ་དང་།
en: An agara times an agara is a pravara.

source: ར་བ་དང་།
en: A pravara times a pravara is a mapara.

source: ཁང་པ་དང་།
en: A mapara times a mapara is an avara.

source: སྐར་ཁུང་དང་།
en: An avara times an avara is a tapara.

source: ཁང་པ་བརྩེགས་པའི་ཚད་ཤེས་པར་བྱ་བ་དང་།
en: A tapara times a tapara is a sīma.

source: འཁྲུལ་འཁོར་དང་།
en: A sīma times a sīma is a yāma.

source: ཤིང་རྟ་སྦྱར་བའི་ཚུལ་སྣ་ཚོགས་ཤེས་པར་བྱ་བ་དང་།
en: A yāma times a yāma is a nena.

source: དགེ་མི་དགེ་དང་།
en: A nena times a nena is an avaga.

source: འཇིགས་མི་འཇིགས་ཀྱི་ལྟས་དང་།
en: An avaga times an avaga is one mṛgava.

source: མཚན་མ་ཤེས་པར་བྱ་བ་དང་།
en: One mṛgava times one mṛgava is one vināha.

source: རྨོས་དང་། ཚོང་དང་།
en: A vināha times a vināha is one viraga.

source: རྣམ་པར་སྤྱད་པ་སྦྱར་བའི་ཆོ་ག་ཤེས་པར་བྱ་བ་དང་།
en: A viraga times a viraga is one avagama.
